## JPA

![img](https://github.com/mistyblue0302/TIL/blob/main/Image/JPA.png)

- **JPA**는 **자바 진영의 ORM 기술 표준**으로 애플리케이션과 JDBC 사이에서 동작
- **패러다임 불일치 문제를 개발자 대신 해결해준다.**
  - 객체는 다형성, 추상화, 상속의 성질을 갖고 있으며 연관관계를 참조를 이용한다. 반면 데이터베이스는 데이터 중심으로 구조화되어 있고 연관관계를 외래키를 이용해 참조한다. 이러한 패러다임 불일치는 개발자가 중간에서 해결해 주어야하는 단점이 있다.
- **생산성** : 객체를 데이터베이스에 저장할 때 JPA는 **Entity 분석 및 INSERT 쿼리문을 실행하고 JDBC API도 대신 처리**해주기 때문에 반복적인 SQL문을 작성하지 않아도 된다.(ORM 프레임워크가 중간에서 매핑)
- **유지보수성** : SQL에 의존적인 개발을 할 경우 엔티티 필드에 수정이 일어날 경우 Mapper 부터 JDBC API 코드를 변경해야한다. 반면 JPA는 이러한 과정을 대신 처리해주기 때문에 유지보수해야 할 코드가 줄어든다.
